Imports

In [229]:
import pandas as pd
import numpy as np
from io import StringIO
import string
import re

Creating Dataframe

In [230]:
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

# convert to pandas using StringIO
df = pd.read_csv(StringIO(data), sep=";")

df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []          NaN  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]          NaN  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

Task 1: Fill missing values in 'Fligt Codes'

In [231]:
# Fill NaN values using an interpolation method, so it dynamically fills in the missing values
df['FlightCodes'].interpolate(method='linear', inplace=True)
df['FlightCodes'] = df['FlightCodes'].astype('int')

df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]        20015  WAterLoo_NEWYork
1   <Air France> (12)            []        20025  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]        20035    CALgary_Ottawa
3      12. Air France      [78, 66]        20045  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]        20055   london_MONTreal

Task 2: Split From and To into two separate columns

In [232]:
# split the column on '_'
df[['To', 'From']] = df['To_From'].str.split('_', expand=True)

# Drop the To_From column 
df.drop(['To_From'], axis=1, inplace=True)

# Convert To and From columns to uppercase
df['To'] = df['To'].str.upper()
df['From'] = df['From'].str.upper()

df.head()

         Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada (!)      [21, 40]        20015  WATERLOO    NEWYORK
1   <Air France> (12)            []        20025  MONTREAL    TORONTO
2  (Porter Airways. )  [60, 22, 87]        20035   CALGARY     OTTAWA
3      12. Air France      [78, 66]        20045    OTTAWA  VANCOUVER
4   ".\.Lufthansa.\."      [12, 33]        20055    LONDON   MONTREAL

Task 3: Clean the Airline Codes

In [233]:
# Remove all punctuation except spaces
df['Airline Code'] = df['Airline Code'].apply(lambda s: re.sub(r'[^\w\s]', '', s))

df.head()

      Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada       [21, 40]        20015  WATERLOO    NEWYORK
1    Air France 12            []        20025  MONTREAL    TORONTO
2  Porter Airways   [60, 22, 87]        20035   CALGARY     OTTAWA
3    12 Air France      [78, 66]        20045    OTTAWA  VANCOUVER
4        Lufthansa      [12, 33]        20055    LONDON   MONTREAL